{
 "title" :           "AtoZ CSS News",
 "subject_line":     "AtoZ CSS: Sass and CSS style guides tools and resources",
 "tag_line" :        "My favourite articles and news plus a new CSS tip",
 "intro_text" :      "This week I came across a whole load of style guide resources which I thought y'all might find interesting. Enjoy!",
 "css_tip_letter":   "H",
 "css_tip_property": "Height",
 "wistia_id":        "ig3axa1zs3",
 "news": [
    {
	"url":	        "https://frontify.com/styleguide",
	"link_text":    "Frontify",
	"link_comment": "First up is a (free) service that promises simple fast and fun style guide creation. You can upload assets, select colours add typography and then share the styleguide with your team or clients. Looks pretty fancy - I'll be trying it out soon!"
    },{
	"url":	        "http://sassdoc.com/",
	"link_text":    "Sass Doc",
	"link_comment": "Sass Doc is an npm module that dynamically builds a documentation site from comments in your Sass. It's also highly customisable and themeable so you can make it your own. Documentation can sometimes be a chore but tools like this make it a breeze. Check it out."
    },{
	"url":	        "http://styleguides.io/podcast/",
	"link_text":    "Style Guide Podcast",
	"link_comment": "If you're a podcast lover like me, you'll love the Style Guide Podcast with Anna Debenham and Brad Frost. There's 12 episodes all about style guides and a whole load of articles and other resources too."
    },{
	"url":	        "http://blog.bitovi.com/style-guide-driven-development/",
	"link_text":    "A How To Guide To Improve your Development Workflow",
	"link_comment": "In this post, Adriana goes into detail about the benefits of using a living style guide and a fairly simple 4-step process for use in development which should make developers (and other team members) happy. Sounds good to me!"
    },{
	"url":	        "http://documentcss.com/",
	"link_text":    "DocumentCSS",
	"link_comment": "If we can agree that having a style guide is a good thing, Document CSS is a tool that can help. It automatically creates a living style guide with interactive examples - that change as your design changes. I'm all for processes that make things like this easier and (once I get some time) will be keen to try this out."
    },{
	"url":	        "http://www.twitter.com/atozcss",
	"link_text":    "New Twitter Account: @atozcss",
	"link_comment": "I've decided (at long last) to move all my CSS related twittering to its own account. But at the moment, it's looking a bit lonely over there :( so I thought I'd take this opportunity to ask you to follow @atozcss if you'd like to stay in the loop, more CSS links, and whatever else we can think of! Thanks very much!"
	}
  ]
}
