{
 "title" :              "AtoZ CSS News",
 "subject_line":		"Is CSS dead? AtoZ CSS News special",
 "tag_line" :           "My favourite articles and news plus a new CSS tip",
 "intro_text" :	        "There's been a lot of talk recently (especially in the React JS community) about the future of CSS - the new idea being that we don't need CSS and we should do everything in JavaScript. I've hunted down 5 great links on the subject so you can see which side of the fence you land. I think the idea is very interesting and could be great for very dynamic apps but I think CSS will definitely still have a place for styling content and adding visual enhancements like animations to sites for a good while yet. I'd love to hear your thoughts though!",
 "css_tip_letter":      "F",
 "css_tip_property":    "Float",
 "wistia_id":		"t8ekz6iwcv",
 "news": [
    {
	"url":	        "http://shoptalkshow.com/episodes/180-panel-on-inline-styles/",
	"link_text":    "Shoptalk: Panel on Inline Styles",
	"link_comment": "This is what kicked off my digging in to this topic (prompted by a tweet from @kurtjc). Nicole Sullivan, Jeremy Keith, Jed Schmidt and Colin Megill join Chris and Dave to discuss this topic in depth - with a surprising lack of Hot Drama!"
    },{
	"url":	        "https://css-tricks.com/the-debate-around-do-we-even-need-css-anymore/",
	"link_text":    "Do We Even Need CSS Anymore?",
	"link_comment": "Chris does a great job of explaining the issues in CSS that have prompted a move to injecting inline styles with JS along with some of the benefits to doing this. This is a great place to start in finding out what all the fuss is about."
    },{
	"url":	        "https://www.youtube.com/watch?v=NoaxsCi13yQ",
	"link_text":    "Inline Styles Are About To Kill CSS",
	"link_comment": "In this video from CSS Conf, Colin Megill (also on the Shoptalk panel) proposes that JavaScript is the future of CSS - especially for rich interactive applications. By this point, I'm starting to come round to the idea but still think CSS has it's place and is a much easier on-ramp for those new to web design/development."
    },{
	"url":	        "http://formidablelabs.com/blog/2015/03/01/launching-radium/",
	"link_text":    "Launching Radium",
	"link_comment": "If you're a React developer and like the sound of this new approach, you may want to check out Radium, a set of tools to manage inline styles on React elements. It gives you powerful styling capabilities without CSS and was built by Formidable Labs. They do a great job of explaining the how and what along with some Codepen demos. Definitely an interesting read."
    },{
	"url":	        "https://byjoeybaker.com/react-inline-styles",
	"link_text":    "React Inline Styles are Fundamentally Flawed",
	"link_comment": "Joey Baker disagrees (at least in part) and outlines why: no media queries, no @keyframes, no cascading styles and potentially performance issues."
	}
  ]
}
