{
 "title" :           "AtoZ CSS News",
 "subject_line":     "CSS animation, motion sensitivity, SVG and a new video!",
 "tag_line" :        "My favourite articles and news plus a new CSS tip",
 "intro_text" :      "Welcome to another issue of AtoZ CSS News! This will be (another) jam-packed list of links about animation - it definitely seems to be the thing that everyone's talking about. Enjoy!",
 "css_tip_letter":   "G",
 "css_tip_property": "General Sibling",
 "wistia_id":        "9d4r1qiqe4",
 "news": [
    {
	"url":	        "https://cssanimation.rocks/courses/animation-101/",
	"link_text":    "CSS Animation 101 Course",
	"link_comment": "Something amazing happened the other day: I won a Twitter competition! And the prize was free entry into @donovan's CSS animation email course. The content is absolutely fantastic, well presented and very comprehensive and I highly recommend you check it out. If you'd rather just read some animation articles, there's some great stuff to be found on the cssanimation.rocks homepage."
    },{
	"url":	        "http://alistapart.com/article/designing-safer-web-animation-for-motion-sensitivity",
	"link_text":    "Designing Safer Web Animations For Motion Sensitivity",
	"link_comment": "Val Head takes a deep dive into the rarely discussed topic of motion sensitivity on the web. With a plethora of scroll-jacking and parallax sites on the web these days, we really should keep in mind what affect that *could* have on our users instead of just chasing the next shiny trend of move all the things. This is a great, insightful read."
    },{
	"url":	        "https://medium.com/design-optimizely/diving-deep-into-svg-animations-1e8c1b759b85",
	"link_text":    "Diving deep into SVG animations",
	"link_comment": "The team at Optimizely have been digging in to SVG animations as an alternative to the standard CSS and jQuery flavours. In this post they share their research process, the lessons they learned and a whole load of resources and further reading too. I really appreciate that they took the time to not just write about what they did, but what they learned from it. Great stuff."
    },{
	"url":	        "http://www.htmlcsscolor.com/",
	"link_text":    "HTML CSS Color Picker",
	"link_comment": "I've seen many online colour pickers and tools over the years but this one is just full of great info. It details common sets of colours (such as the named CSS colours) and includes a gradient generator. If you click to view info about a particular colour you'll see charts and graphs full of detail, along with variations, componet colours, tints, harmonies, contrast and some code examples. Impressive."
    },{
	"url":	        "https://www.codeschool.com/courses/adventures-in-web-animations",
	"link_text":    "Adventures in Web Animations",
	"link_comment": "I recently recorded some new video content for Code School as part of their recent course in web animation techniques. I produced a video all about the animate.css library which is currently available on Code TV https://www.codeschool.com/shows/code-tv and I have another video coming soon. Please support AtoZ and our sponsors by checking them out!"
    },{
	"url":	        "http://www.twitter.com/atozcss",
	"link_text":    "New Twitter Account: @atozcss",
	"link_comment": "I've decided (at long last) to move all my CSS related twittering to its own account. But at the moment, it's looking a bit lonely over there :( so I thought I'd take this opportunity to ask you to follow @atozcss if you'd like to stay in the loop, more CSS links, and whatever else we can think of! Thanks very much!"
	}
  ]
}
