{
 "title" :              "AtoZ CSS News",
 "tag_line" :           "My favourite articles and news plus a new CSS tip",
 "subject_line":        "CSS image diffing, syncing audio with animations, tools and my first post in 5 months!",
 "intro_text" :	        "I've got another handful of cracking articles for your this week, including one written by myself (for a change!). As always, if you've seen or written anything you think should appear in next week's issue, please do let me know. Cheers!",
 "css_tip_letter":      "J",
 "css_tip_property":    "Justify Content",
 "wistia_id":		"h307awvs6z",
 "news": [
    {
	"url":	        "http://franklinta.com/2014/11/30/image-diffing-using-css/",
	"link_text":    "Image diffing using CSS",
	"link_comment": "Franklin shares an absolutely amazing CSS trick for diffing images using CSS filters. If this had been around when I was a kid, I'd have nailed “spot the difference” games."
    },{
	"url":	        "http://www.sitepoint.com/syncing-css-animations-with-html5-audio/",
	"link_text":    "Syncing CSS Animations with HTML5 Audio",
	"link_comment": "We've shared a lot of animation links over the last few weeks but this is the first I've heard of syncing up animations with audio. In this post Mihaela goes in depth and shows how to create a pure CSS heart complete with beating sound. Smart stuff."
    },{
	"url":	        "http://zurb.com/playground/css-flip-book",
	"link_text":    "CSS Flip Book",
	"link_comment": "Last week's post about the CSS Moonwalk got so much attention that I thought I'd look for something similar this week. The chaps at ZURB (creators of Foundation) recently published this experiment which uses media queries to run an animation."
    },{
	"url":	        "http://katydecorah.com/css-ruler/",
	"link_text":    "CSS Ruler",
	"link_comment": "This interactive demo is a great way to learn about all sorts of length units in CSS. From absolute units to variable length units such as font relative units and viewport relative units, this is a great little tool."
    },{
	"url":	        "http://guyroutledge.co.uk/blog/the-css-and-other-tech-behind-the-food-rush/",
	"link_text":    "The CSS and other tech behind The Food Rush",
	"link_comment": "I'm working on a new thing. It's an online magazine celebrating everything innovative and geeky about food and food tech. We're building an MVP in 10 days and doing the whole thing in the open, and this is my post for day 2 of the experiment. There's a good dose of CSS how-to as well as a bit of background about the project. If you love food and tech, I'd be incredibly grateful if you check it out and sign up at www.thefoodrush.com. Cheers!"
	}
  ]
}
