{
 "title" :              "AtoZ CSS News",
 "tag_line" :           "My favourite articles and news plus a new CSS tip",
 "subject_line":        "AtoZ CSS: Typography tips, tricks and tools",
 "intro_text" :	        "Since this week's #csstip is all about line-height, I thought I'd go in search of a whole load of typography related content. Since most of what we look at on the web is text, it's worth taking the time to have it look its best. Enjoy!",
 "css_tip_letter":      "L",
 "css_tip_property":    "Line height",
 "wistia_id":		"fwtui3zjc3",
 "news": [
    {
	"url":	        "Advanced web typography: Open Type Features",
	"link_text":    "http://www.elliotjaystocks.com/blog/a-recap-on-opentype-features/",
	"link_comment": "For anyone who's not familiar with Open Type features in CSS (things that make your type look all fancy), Elliot J Stocks provides a great overview in this article and a previous four-post series. Here we're talking kerning, ligatures, small caps, numerals, swashes and stylesets."
    },{
	"url":	        "http://kennethormandy.com/journal/normalize-opentype-css",
	"link_text":    "Normalize Opentype CSS",
	"link_comment": "You may be familiar with the normalize.css 'reset' but I recently came across this alternative reset for type nerds which sets up and normalises Open Type font features (like those in the first article). The project is available on Github but this post gives a great overview of what it does."
    },{
	"url":	        "https://sassline.com/",
	"link_text":    "Sass Line",
	"link_comment": "Very much drawing on the theme of line-height and using it to create consitent vertical rhythm, Jake Giltsoff has created a fantastic tool for Sass users. The tool provides an easy to use way of setting a baseline grid for your type, allowing you to achieve meticulous vertical rhythm and a modular scale for your type sizes."
    },{
	"url":	        "http://webdesign.tutsplus.com/series/a-z-of-web-typography--webdesign-11706",
	"link_text":    "A-Z of Web Typography",
	"link_comment": "Drawing on a very familiar theme, Tuts+ have produced an A-Z of all things type. It may not be a complete set yet, but there are some great articles here for digging in to this hugely important topic."
    },{
	"url":	        "http://webtypography.net/",
	"link_text":    "The Elements of Typographic Style Applied to the Web",
	"link_comment": "This (free) online book provides a great grounding in the principals in typography and how they can be applied to the modern web. The project is open source and if you have any typographic knowledge to share, I'm sure they'd be happy for your contributions!"
	}
  ]
}
