{
 "title" :              "AtoZ CSS News",
 "tag_line" :           "My favourite articles and news plus a new CSS tip",
 "subject_line":        "AtoZ CSS: Specificity, Naming things, Sass resources, Angled edges and more!",
 "intro_text" :	        "It's been a busy week of 5am starts but never fear, CSS News is here - a day late but here never the less. Here's a selection of interesting things I came across over the last few days. Enjoy!",
 "css_tip_letter":      "N",
 "css_tip_property":    "Nth-Child",
 "wistia_id":		"8effled1nu",
 "news": [
    {
	"url":	        "http://philipwalton.com/articles/do-we-actually-need-specificity-in-css/",
	"link_text":    "Do we actually need Specificity in CSS?",
	"link_comment": "Having just taught a class on specificity, this title caught my eye. @philipwalton has been featured here before and this is yet another exceptionally written article. It's an interesting question to pose and I expect one day we'll talk about the 'back in the day' when we had to deal with specificity. Interesting stuff."
    },{
	"url":	        "http://www.cssauthor.com/sass-resources/",
	"link_text":    "The Ultimate Sass Resources & Tools",
	"link_comment": "If you like your content jam-packed full of value then this round up from CSS Author has it in buckets. Frameworks, grids, compilers, components, plugins, generators, libraries and loads more have all been compiled into a vast list and split up into categories. Let's hope the AtoZ CSS Sass course makes it to the list next year!"
    },{
	"url":	        "https://robots.thoughtbot.com/naming-colors",
	"link_text":    "Naming Colors",
	"link_comment": "You've probably heard the age-old quote about the hardest thing in programming (naming things) but in this short and sweet post, Reda from Thoughtbot outlines a solid way of handling naming of colours in CSS variables. I tend to use naming conventions but this method looks worth a shot for sure."
    },{
	"url":	        "https://viget.com/inspire/angled-edges-with-css-masks-and-transforms",
	"link_text":    "Angled edges with CSS masks and transforms",
	"link_comment": "And now for something more practical. In this tutorial from Viget, Jeremy experiments with pseudo elements and the transform and clip path properties to make some interesting shapes. I'm designing a very angular and polygon-style site at the moment and there's some great tips in here for doing just that."
    },{
	"url":	        "http://anthonydugois.com/svg-path-builder/",
	"link_text":    "SVG Path Builder",
	"link_comment": "I don't know about you, but bezier curves have always been my downfall whenever I try and turn my hand to design. They confuse the hell out of me! This tool could go a good way to helping me understand what's really going on though. Not only is this tool useful, it's beautifully designed. I highly recommend checking it out."
	}
  ]
}
