{
 "title" :              "AtoZ CSS News",
 "tag_line" :           "My favourite articles and news plus a new CSS tip",
 "subject_line":        "CSS Blend modes, Gifts for Geeks, Pure CSS Darth Vader and more...",
 "intro_text" :	        "With the holiday season almost up on us, there's just a few weeks of the year left to cram in some extra CSS goodness. On the blog this week we're talking fancy fonts with Open Type features and below are a few of my favourite links from the past week. I hope you enjoy them!",
 "css_tip_letter":      "T",
 "css_tip_property":    "Open Type Features",
 "wistia_id":		"kuc9u5inju",
 "news": [
    {
	"url":	        "http://webdesign.tutsplus.com/tutorials/blending-modes-in-css-color-theory-and-practical-application--cms-25201",
	"link_text":    "Blending Modes in CSS",
	"link_comment": "Blend modes are something that designers have been using for years in apps like Photoshop but now we can use them in CSS. Perhaps it won't be long before designing in the browser will really be the norm? In this incredibly detailed post, Jonathan Cutrell goes into the colour theory and practical application of this exciting new CSS feature."
    },{
	"url":	        "http://shoptalkshow.com/2015-gift-guide/",
	"link_text":    "Shop Talk Show 2015 Holiday Gift Gudide",
	"link_comment": "Shop Talk Show is my favourite web-dev podcast and they've compiled a great list of gifts for geeks. If you have someone special in your life that likes to code as much as you do, you may find the perfect present for them here. I've got my eye on a CSS is Awesome Mug and perhaps a Desk Pad. How about you?"
    },{
	"url":	        "https://gethtml.at/",
	"link_text":    "Get HTML",
	"link_comment": "Our focus may be CSS here at AtoZ but everything starts with HTML. One of my students recently showed me this great resource for browsing all the different HTML elements in this beautifully simple side project."
    },{
	"url":	        "http://ytiurin.github.io/html5tooltipsjs/",
	"link_text":    "HTML5 Tooltips",
	"link_comment": "Doing the rounds this week is this beautiful demo site for a library of tooltips. They are built in pure JS (no framework or library required) and animated with 3D CSS. The design is simple and the animations are tasteful; if you're in need of a tooltip, this is a great place to start!"
    },{
	"url":	        "https://tsitu.github.io/darth.html",
	"link_text":    "CSS Darth Vader",
	"link_comment": "And finally, this morning I found this great auto-building pure CSS Darth Vader. This is reminiscent of the self-coding codepen heart from earlier in the year (or was it last year) but it's great to see the process step by step. It's quite long so I recommend running at the fastest speed but the end result is worth it!"
	}
  ]
}
