{
 "title" :              "AtoZ CSS News",
 "tag_line" :           "My favourite articles and news plus a new CSS tip",
 "subject_line":        "AtoZ CSS: ",
 "intro_text" :	        "I'm working on a new site and its exciting. It has a slightly unconventional layout and lots of irregular shapes. In working out how to build it, I came across a couple of great resources and a handful of other articles (see below). Also, in this week's CSS Tip I parted from the usual format and have answered 4 common questions I get asked a lot. Let me know what you think...",
 "css_tip_letter":      "Q",
 "css_tip_property":    "Q&A",
 "wistia_id":		"y3p4f1gz4k",
 "news": [
    {
	"url":	        "http://www.creativebloq.com/web-design/get-started-css-polygons-111517938",
	"link_text":    "Get Started with CSS Polygons",
	"link_comment": "My new project is full of triangles, polygons and 3D. It's not quite as exciting as the Species in Pieces that did the rounds earlier this year but Bryan James, the creator of that awesome side project has written up a great getting started guide to working with CSS polygons for Creative Bloq. Check it out."
    },{
	"url":	        "http://bennettfeely.com/clippy/",
	"link_text":    "Clippy: CSS clip-path maker",
	"link_comment": "Continuing the theme of polygons, I came across this brilliant interactive tool for creating them and then grabbing the code required to build the shape you've created. @bennettfeely has created a great tool here and I'd highly recommend having a play with it."
    },{
	"url":	        "https://medium.com/front-line-interaction-design/7-ways-for-new-designers-to-make-themselves-indispensable-in-their-early-careers-337caae227ec#.s74cnahs9",
	"link_text":    "How to Make Yourself Indispensible",
	"link_comment": "Starting out is tough and in this modern age where design and web development are starting to be comoditised, it can sometimes feel like you have to cut your price and work twice as long to win the favour of clients and employers. There's some great words of wisdom in this piece - a great read for creative professionals of all levels."
    },{
	"url":	        "http://ninodezign.com/18-examples-svg-awesome-effects/?utm_content=buffer1dabb&utm_medium=social&utm_source=twitter.com&utm_campaign=buffer",
	"link_text":    "18 Examples of SVG with Awesome Effects",
	"link_comment": "SVG is great as an image format but it's incredibly versatile when it comes to animation. It's not something I've had the opportunity to play with much yet but this round up post is certainly full of inspiring ideas for what's possible."
    },{
	"url":	        "https://ghinda.net/article/css-ripple-material-design/",
	"link_text":    "Material Design Ripples with CSS",
	"link_comment": "In this tutorial, Ionut goes through the process of building Google's Material Design ripples in pure CSS using some pseudo classes, sibling combinator selectors and a dash of keyframe animations."
	}
  ]
}
