{
 "title" :              "AtoZ CSS News",
 "tag_line" :           "My favourite articles and news plus a new CSS tip",
 "subject_line":        "AtoZ CSS: Workmanship, Spinners, Effects and Inspiration",
 "intro_text" :	        "Welcome to another week of CSS News and inspiration - with emphasis on the inspiration this week. Here's a handful of interesting effects and a couple of articles about writing solid, readable code. Enjoy!",
 "css_tip_letter":      "O",
 "css_tip_property":    "Opacity",
 "wistia_id":		"1lm6l98v58",
 "news": [
    {
	"url":	        "http://workmanship.io/",
	"link_text":    "Workmanship Manual",
	"link_comment": "First up, an excellent guide compiled by @_fookay outlining some best practices for writing HTML and CSS. Not only does it provide guidelines, it provides the reasons behind them too. And the whole thing is wrapped up in a really slick interactive design. Inspiring and useful!"
    },{
	"url":	        "http://www.css-spinners.com/",
	"link_text":    "CSS Spinners",
	"link_comment": "If you're looking for a way to add a bit of animated goodness to your next project, this collection of 18 spinners could be just what you're after. Each spinner uses minimal markup and come in both Sass and CSS flavours for you to modify as needed."
    },{
	"url":	        "http://tympanus.net/codrops/2015/11/04/rain-water-effect-experiments/",
	"link_text":    "Rain & Water Effects",
	"link_comment": "Here's another dose of inspiration, this time from the ever-amazing @codrops. I saw these rain effects doing the rounds on Twitter and couldn't believe they were made with CSS and Javascript. Check them out, it's some impressive stuff!"
    },{
	"url":	        "https://medium.com/@AndrewRocco/css-as-readable-by-humans-21ad57d845c9",
	"link_text":    "CSS as Readable by Humans",
	"link_comment": "In this Medium post, Andrew Rossi outlines a case for human-readable code which is a concept that I can definitely get behind. The only thing I'd disagree with is alphabetical CSS property ordering but otherwise they're some great nuggets of wisdom in here."
    },{
	"url":	        "http://tobiasahlin.com/typesource/",
	"link_text":    "Google Web Font Inspiration",
	"link_comment": "For your final dose of inspiration this week, @tobiasahlin has created a great showcase of well-paired Google Fonts. Seaching the Google fonts library can sometimes be a bit overwhelming so these could be a good place to start. He also has a series of CSS spinners if you have yet to find the perfect candidate above!"
	}
  ]
}
