{
 "title" :              "AtoZ CSS News",
 "tag_line" :           "My favourite articles and news plus a new CSS tip",
 "subject_line":        "AtoZ CSS: New Year, New Series, and lots more CSS News!",
 "intro_text" :	        "Happy New Year! I hope you had a great holiday season and are refreshed and ready to produce some more awesome work this year. This is going to be a big year for AtoZ CSS with a new Sass video series already in the pipeline and new books and courses on the horizon. As a loyal subscriber, you have the opportunity to have a say in what goes on round here so do drop me an email (just hit reply) and let me know what you'd like to learn about this year. In the meantime, let's do The News...",
 "css_tip_letter":      "W",
 "css_tip_property":    "Widows and Line Breaks",
 "wistia_id":		"w6czfxn0k9",
 "news": [
    {
	"url":	        "http://www.atozcss.com/blog/css-tip-w/",
	"link_text":    "AtoZ Tip: Widows and Line Breaks",
	"link_comment": "Learn when and when not to use break tags in your projects and how to work around unpleasant line breaks in this week's CSS Tips."
    },{
	"url":	        "http://www.atozcss.com/blog/css-tip-v/",
	"link_text":    "AtoZ Tip: Vertical Alignment",
	"link_comment": "I thought it best not to both you over the holiday season so there was no AtoZ CSS News last week. But in case you haven't had a chance to catch up on last week's tip, go and have a read about a load of different ways to achieve vertical alignment in CSS."
    },{
	"url":	        "https://medium.com/@nicolaerusan/conceptual-debt-is-worse-than-technical-debt-5b65a910fd46#.g7m0mztoy",
	"link_text":    "Conceptual Debt Is Worse Than Technical Debt",
	"link_comment": "Technical debt builds up throughout the lifetime of a project as technical decisions made now may lead to unforseen and undesirable situations in the future. In this post, Nicolae Rusan spins this concept around and discusses the issue of “conceptual debt” which arises from making bad design choices when deciding how to present or model your product. This is some thought provoking stuff!"
    },{
	"url":	        "http://seesparkbox.com/foundry/naming_css_stuff_is_really_hard",
	"link_text":    "Naming CSS Stuff Is Really Hard",
	"link_comment": "I've thought it and no doubt said it many times before. Naming things is a constant pain in the ass when writing code (or starting a company or having children!). This classic article from Sparkbox outlines a process for naming things by looking at whether a class is functional, content-based or presentational. This is less of a naming convention or system but a great way to think about this problem."
    },{
	"url":	        "http://flexboxgrid.com/",
	"link_text":    "Flexbox Grid",
	"link_comment": "Flexbox is building a lot of momentum at the moment. I've been working with it a lot lately and am planning to do an online workshop all about flexbox later in the year (reply to this email to register your interest and I'll keep you in the loop). I recently came across this interesting grid system by @dam which is entirely based on flexbox. It's very poweful and very flexible, pun intended!"
    },{
	"url":	        "http://photoshopetiquette.com/",
	"link_text":    "Photoshop Etiquette",
	"link_comment": "We talk a lot about CSS and front-end development here at AtoZ but I bet a lot of your job also revolves around working with design tools like Sketch or Photoshop. There's lots to be learned about how to best use these tools but there's also some best practices for producing user-friendly design documents. This online guide is a great foundation in taking an organised, clear and concise approach to web design."
    }
  ]
}
