{
 "title" :              "AtoZ CSS News",
 "tag_line" :           "My favourite articles and news plus a new CSS tip",
 "subject_line":        "AtoZ CSS: Redesign the Web, Filters, Best Practices, Calc and Gameboys",
 "intro_text" :	        "After a fairly quiet week here in sunny south-west London, things are starting to ramp up again - I do prefer being busy! However, never fear, your weekly dose of CSS news is here with a couple of cracking articles this week. Enjoy!",
 "css_tip_letter":      "M",
 "css_tip_property":    "Media Queries",
 "wistia_id":		"85ensigs69",
 "news": [
    {
	"url":	        "https://medium.com/@callmevlad/let-s-redesign-web-design-2d67aec798e#.abicv2b6p",
	"link_text":    "Let's Redesign The Web",
	"link_comment": "Vlad from Webflow (a web builder application gaining some serious traction) showcases some of the poweful features of their product and demonstrates the potential of a true *design* tool rather than a coding tool. It's pretty mind blowing and I'm excited to see what their future holds."
    },{
	"url":	        "http://una.im/CSSgram/",
	"link_text":    "CSSGram",
	"link_comment": "The ever-talented @una has been experimenting again and has come up with this fantastic library for recreating Instagram style filters with pure CSS and blend modes. Fancy."
    },{
	"url":	        "https://medium.com/@Heydon/things-to-avoid-when-writing-css-1a222c43c28f#.mxq8enrbq",
	"link_text":    "Things to Avoid when Writing CSS",
	"link_comment": "Keeping up with best practices is something I've always tried to do and in this post by @heydonworks, we have an opinionated (but totally spot on) post about things to avoid when writing CSS."
    },{
	"url":	        "http://vincentp.me/blog/use-cases-for-calc/",
	"link_text":    "Use Cases for CSS Calc()",
	"link_comment": "CSS calc() is a somewhat under-used way of calculating values from a mathematical expression. The great thing about it is you can do things like calc( 100% - 20px ). In this post Vincent goes over a handful of use cases in response from a tweet from @csswizardry."
    },{
	"url":	        "http://www.bchanx.com/animated-gameboy-in-css",
	"link_text":    "Animated Gameboy in CSS",
	"link_comment": "And finally. A really awesome implementation of an animated gameboy made with pure CSS (I actually had one of the originals many years ago!). Not only does it look great, there's a whole post about how this was made. Very cool indeed!"
	}
  ]
}
