{
 "title" :              "AtoZ CSS News",
 "subject_line":	"AtoZ CSS News: BEM, zooming experiments, multi-lingual design and more!",
 "tag_line" :           "My favourite articles and news plus a new CSS tip",
 "intro_text" :	        "I can't believe it's September already! But what better way to kick off a new month than by reading some great CSS articles? :)",
 "css_tip_letter":      "E",
 "css_tip_property":    "Enabled",
 "wistia_id":		"k62bvbu9bi",
 "news": [
    {
	"url":	        "http://csswizardry.com/2015/08/bemit-taking-the-bem-naming-convention-a-step-further/",
	"link_text":    "BEMIT: Taking the naming convention further",
	"link_comment": "I'm always interested to read Harry Roberts' thoughts on CSS and this article is definitely thought provoking. If you're a fan of the BEM naming convention, you may like this collection of ideas for adding even more meaning to your code."
    },{
	"url":	        "http://www.jonikorpi.com/zoomable-ui-for-the-web/",
	"link_text":    "Zoomable UI for the web",
	"link_comment": "In this article, Joni writes up an experiment that he's implemented on his site for a zooming transition between pages. It's a really interesting proof of concept and his whole site is full of great content too."
    },{
	"url":	        "http://responsivenews.co.uk/post/123104512468/13-tips-for-making-responsive-web-design",
	"link_text":    "13 Tips for Making Responsive Design Multi-Lingual",
	"link_comment": "I've recently completed a multi-lingual site for an international tequila brand and I wish I'd read this post from the BBC before hand. There's loads of great tips including some surprising revelations about the difference between nations and languages."
    },{
	"url":	        "https://typographyontheweb.com/",
	"link_text":    "Typography on the Web",
	"link_comment": "So much of what we design and develop centers around text that I wouldn't be surprised if someone has coined the phrase “typography first”. This site provides a resource roundup of books, websites, videos and tools for improving your typographic skills."
    },{
	"url":	        "https://medium.com/@patrickbrosset/css-grid-layout-6c9cba6e8a5a",
	"link_text":    "The future of layout with CSS: Grid Layouts",
	"link_comment": "If you've read my Guide to Layout and Document Flow book, you'll already know about the new Grid Layout spec but in this article, Patrick gives a great overview of what it is, how it works and why it's the future of CSS layouts."
	}
  ]
}
