{
 "title" :              "AtoZ CSS News",
 "tag_line" :           "My favourite articles and news plus a new CSS tip",
 "intro_text" :	        "I've been getting back into screencasting mode recently (see below...) and of course, I've also been scouring the web for all sorts of interesting articles for your reading pleasure. Enjoy!",
 "css_tip_letter":      "C",
 "css_tip_property":    "Color",
 "wistia_id":		"qmw1dqzbd4",
 "news": [
    {
	"url":	        "http://buff.ly/1DFAmrt",
	"link_text":    "Learn Less in 10 Minutes",
	"link_comment": "I mostly write Sass but on occasion, a contract might call for using Less or Stylus. If you need to level up in Less, 10 minutes sounds like a pretty enticing value proposition!"
    },{
	"url":	        "http://buff.ly/1DGW4v0",
	"link_text":    "Can I Use from the Command Line",
	"link_comment": "This tool is really useful! I'm often searching for browser support over at caniuse.com but with this handy Node package, I can get the info I need without leaving my local development environment."
    },{
	"url":	        "http://buff.ly/1PoqXpD",
	"link_text":    "Oxygen",
	"link_comment": "If OOCSS, SMACSS and BEM or AtomicOOBEMITSCSS don't float your boat, how about Oxygen? An object orientated methodology for CSS."
    },{
	"url":	        "http://buff.ly/1KlmteY",
	"link_text":    "CSS Colorful Icons",
	"link_comment": "This Codepen features 10 funky little icons made entirely with CSS. I particularly like the little border-radius highlights - a great proof of concept."
    },{
	"url":	        "http://buff.ly/1L2fA4W",
	"link_text":    "Checkbox Trickery with CSS",
	"link_comment": "To Do apps are usually the realm of JavaScript tutorials but here, Will demonstrates how checkboxes can make a pure CSS to-do app. Pretty clever stuff!"
	},{
	"url":	        "http://mbsy.co/czMZQ?url=http://webdesign.tutsplus.com/courses/building-static-websites-with-jekyll",
	"link_text":    "Building Static Sites with Jekyll",
	"link_comment": "Finally, I've recently teamed up with Tuts+ to create my first video course for them. The course is very practical and goes step by step through the process of building a simple portfolio site with Jekyll, Markdown, Liquid, Git and Sass. This is a paid course and as a Tuts+ affiliate, I'll earn a small commission for anyone who signs up to watch. Thanks in advance!"
	}
  ]
}
