{
	"subject_line":        "New Video: Creating Custom Functions in Sass",
	"title" :              "AtoZ Sass",
	"episode":             "Episode 6",
	"episode_title":       "Creating Custom Functions in&nbsp;Sass",
	"episode_subtitle":    "making repeatable tasks a breeze...",
	"episode_wistia_id":   "iy66gxeo54",
	"episode_summary":     "Functions are a core concept in many programming languages but creating our own custom functions isn't something we can use in normal CSS.  However, Sass brings the power of programming to the table and does allow us to create custom functions for performing common tasks.  In this episode you'll learn what functions can do and why they're useful, how to create and use your own custom functions in Sass and examples of functions in the real world",
	"episode_letter":      "f",
	"news_intro":          "There's been some interesting developments in the news this week. Last week I shared a link about native CSS variables and this week I saw something about native mixins coming to CSS (link below). These may be a little way off yet so leveling up your Sass is probably no bad thing in the meantime but the future of CSS will certainly be a fascinating place to work! In other news, I'm opening up registration for my first online workshop all about Flexbox. Check out the details below and just hit reply if you have any questions or comments.",
	"news": [
		{
			"url":	        "https://blog.gospodarets.com/css_apply_rule",
			"link_text":    "The CSS @apply Rule",
			"link_comment": "Native CSS mixins now have a working implementation in Chrome."
		},{
			"url":	        "http://www.hongkiat.com/blog/writing-better-css/",
			"link_text":    "Writing Better CSS with Performance in Mind",
			"link_comment": "Reduce style calculations, reflows and repaints."
		},{
			"url":	        "https://web-design-weekly.com/2014/11/18/viewport-units-vw-vh-vmin-vmax/",
			"link_text":    "Viewport Units",
			"link_comment": "Learn all about vw, vh, vmin and vmax."
		},{
			"url":	        "https://css-tricks.com/debouncing-throttling-explained-examples/",
			"link_text":    "Debouncing and Throttling Explained Through Examples",
			"link_comment": "This recently came in very handy on a current client project. Not CSS focused but a great article from CSS-Tricks."
		},{
			"url":	        "http://wesbos.com/git-hot-tips/",
			"link_text":    "Git Hot Tips",
			"link_comment": "Working with CSS often means working with version control. Wes Bos has collated some great Git tips in this post."
		}
	],
	"ad_title":             "Want to Start Using Flexbox?",
	"ad_intro":             "I'll be running an online workshop which will teach you all the flexbox fundamentals and give you a chance to put them into practice. With this action-packed session you'll be set homework exercises which will be marked by Guy and the AtoZ teaching assistants. To learn more click the image below...",
	"ad_image":             "http://www.atozcss.com/img/banners/flexbox-workshop.png",
	"ad_url":               "http://www.atozcss.com/courses/flexbox-in-action",
	"click_to_tweet":       "Learn how to create and use custom functions with Sass in this week's AtoZ CSS screencast."
}
