{
	"subject_line":        "New Episode: BEM with Sass",
	"title" :              "AtoZ Sass",
	"episode":             "Episode 2",
	"episode_title":       "BEM with Sass",
	"episode_subtitle":    "bring structure and meaning to your class names with BEM",
	"episode_wistia_id":   "mncewzddes",
	"episode_summary":     "BEM is a system of naming classes that encourages the good practice of writing modular code.  It can really help bring structure and meaning to the way we name things and it's something I use consistently in my day to day client work. It can be used with or without Sass but Sass and BEM are a great combination. In this video you'll learn what BEM is, what it stands for, how to leverage the Sass ampersand with BEM and some BEM best practices.",
	"episode_letter":      "b",
	"news_intro":          "In this week's news, I stumbled across a couple of very timely posts: one about BEM in a nutshell which is a great compliment to this week's video; and one about writing real CSS (again) which poses an interesting question as to whether Sass will soon become a thing of the past due to it's level of abstraction from real CSS. Personally, I think Sass still has huge merit but it will be interesting to watch this line of thinking unfold.",
	"news": [
		{
			"url":	        "https://blog.decaf.de/2015/06/24/why-bem-in-a-nutshell/",
			"link_text":    "'Why BEM?' In a Nutshell",
			"link_comment": "blog.decaf.de"
		},{
			"url":	        "https://blog.colepeters.com/on-writing-real-css-again/",
			"link_text":    "On Writing Real CSS (again)",
			"link_comment": "blog.colepeters.com"
		},{
			"url":	        "http://bitsofco.de/styling-broken-images/",
			"link_text":    "Styling Broken Images",
			"link_comment": "bitsofco.de"
		},{
			"url":	        "http://www.sitepoint.com/replacing-radio-buttons-without-replacing-radio-buttons/",
			"link_text":    "Replacing Radio Buttons Without Replacing Radio Buttons",
			"link_comment": "sitepoint.com"
		},{
			"url":	        "http://codepen.io/una/pen/aNZEbB",
			"link_text":    "Pure CSS Tic Tac Toe",
			"link_comment": "codepen.io"
		}
	],
	"ad_title":             "Start using Sass today: get the Up and Running with Sass ebook",
	"ad_intro":             "The best way to learn is by doing. In this ebook you'll learn the fundamentals of the Sass language and follow practical exercises for installing Sass via the command line or using the free GUI app, Koala. The book is jam-packed with tips, advice, best practices and practical exercises to help you start working with Sass as quickly as possible. Learn more and buy now on Amazon.",
	"ad_image":             "http://www.atozcss.com/img/banners/sass-book.png",
	"ad_url":               "http://atozcss.com/books/up-and-running-with-sass/",
	"click_to_tweet":       "Learn to write modular code by masting the BEM naming convention in this week's AtoZ Sass video."
}
