{
	"subject_line":        "New Video: Compiling Sass with Grunt and Gulp",
	"title" :              "AtoZ Sass",
	"episode":             "Episode 7",
	"episode_title":       "Compiling Sass with Grunt&nbsp;and&nbsp;Gulp",
	"episode_subtitle":    "automate, automate, automate...",
	"episode_wistia_id":   "kwjzgengyl",
	"episode_summary":     "In this week's video we'll be diving into two command line tools that can help you compile Sass. They both do a *lot* more than just compile Sass so they're definitely worth looking in to. But for the purposes of keeping this video short and to the point, we'll just focus on the Sass side of things.",
	"episode_letter":      "g",
	"news_intro":          "In the news this week...",
	"news": [
		{
			"url":	        "https://medium.com/@adamemdouglas/advanced-css-selectors-you-really-may-not-have-heard-of-and-if-you-have-you-probably-haven-t-a888515e8f2#.qlerehq8g",
			"link_text":    "Advanced CSS Selectors You Really May Not Have Heard of and If You Have You Probably Haven't Used Them",
			"link_comment": "Does exactly as the title suggests. How many have you heard of? How many have you used?"
		},{
			"url":	        "https://www.smashingmagazine.com/2016/04/finally-css-javascript-meet-cssx/",
			"link_text":    "Finally, CSS in Javascript! Meet CSSX",
			"link_comment": "People on Twitter have been going crazy over this article. It's great but do we really want or need CSS in JS?"
		},{
			"url":	        "http://www.sitepoint.com/bem-smacss-advice-from-developers/",
			"link_text":    "BEM and SMACSS: Advice From Developers Who've Been There",
			"link_comment": "This post from SitePoint offers a good intro to these two methodologies and some advice from seasoned pros. Worth a read."
		},{
			"url":	        "http://www.richcss.com/",
			"link_text":    "RichCSS: CSS That Doesn't Drive You Nuts",
			"link_comment": "RichCSS is an Object Oriented CSS framework providing default structures for reusable css elements. Great work, Rich :)"
		},{
			"url":	        "https://flexbox.webflow.com/",
			"link_text":    "Meet the First Visual Flexbox Builder",
			"link_comment": "Webflow is a powerful tool for visually building websites. This flexboox tool looks mighty impressive. Maybe you can skip attending my Flexbox workshop after all!"
		}
	],
	"ad_title":             "Want to Start Using Flexbox?",
	"ad_intro":             "I'll be running an online workshop which will teach you all the flexbox fundamentals and give you a chance to put them into practice. With this action-packed session you'll be set homework exercises which will be marked by Guy and the AtoZ teaching assistants. To learn more click the image below...",
	"ad_image":             "http://www.atozcss.com/img/banners/flexbox-workshop.png",
	"ad_url":               "http://www.atozcss.com/courses/flexbox-in-action",
	"click_to_tweet":       "Grunt or Gulp? Watch these powerful build tools go head to head in this week's screencast by @guyroutledge."
}
